package dz1;

public class Task1 {

	public static void main(String[] args) {

//		Даны два действительных числа х и  у. Вычислить их сумму, разность, произведение и частное.  
		
		double x,y;
		x=28;
		y=23;
		
		System.out.println("Сумма: "+(x+y)+", Разность: "+(x-y)+", Произведение: "+(x*y)+
				", Частное: "+(x/y));

	}

}
