package dz1;

public class Task2 {

	public static void main(String[] args) {
		// Найдите  значение функции: с = 3 + а 
		double a;
		a=77;
		System.out.println("значение функции: с = 3 + а: "+(3+a));
		
	}

}
