package dz1;

public class Task15 {

	public static void main(String[] args) {
		// Написать программу, которая выводит на экран первые четыре степени числа PI. 
		
		System.out.println("Пи: "+(Math.PI)+" Пи в квадрате: "+Math.pow(Math.PI,2)+
		" Пи в третьей: "+Math.pow(Math.PI,3)+" Пи в четвертой: "+Math.pow(Math.PI,4));

	}

}
